Tekla.Structures.Model.Collaboration.IFC2X3_ParametricObject_RectangleHollowProfile
The IFC2X3_ParametricObject_RectangleHollowProfile class contains the rectangular and hollow profile definition.

Tekla.Structures.Model.Collaboration.IFC2X3_ParametricObject_RectangleHollowProfile.XDim
The X dimension.

Tekla.Structures.Model.Collaboration.IFC2X3_ParametricObject_RectangleHollowProfile.YDim
The Y dimension.

Tekla.Structures.Model.Collaboration.IFC2X3_ParametricObject_RectangleHollowProfile.WallThickness
The wall thickness.

Tekla.Structures.Model.Collaboration.IFC2X3_ParametricObject_RectangleHollowProfile.InnerFilletRadius
The inner fillet radius.

Tekla.Structures.Model.Collaboration.IFC2X3_ParametricObject_RectangleHollowProfile.OuterFilletRadius
The outer fillet radius.